---
kind: method
id: M:Autodesk.Revit.DB.STLImportOptions.#ctor
source: html/e4e217f0-ef77-4813-a009-0a2ecb60e681.htm
---
# Autodesk.Revit.DB.STLImportOptions.#ctor Method

Constructs a new instance of STLImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public STLImportOptions()
```